{
  "backend/main.mo": "Main Motoko actor defining Product, Order, Category, and OrderStatus types with CRUD operations for a stationery shop, including product management, order placement, and stock tracking using stable Maps and Sets.",
  "backend/migration.mo": "Minimal migration module with a no-op `run` function that passes the canister state through unchanged.",
  "feature_evidence.json": "Feature evidence report linking two features—fixing the product fetch error in useQueries.ts and ensuring auto-seed logic in CatalogPage.tsx—to their relevant files, test IDs, and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark color themes including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Maa Gayatri Stationers' and mounting the React app at the `#root` div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for catalog (/), checkout (/checkout), and admin orders (/admin/orders), wrapped in CartProvider and Toaster.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in sheet cart sidebar displaying cart items with quantity controls, per-item pricing, and a checkout navigation button; shows an empty state when the cart has no items.",
  "frontend/src/components/Footer.tsx": "Footer component with shop branding, quick navigation links, contact info, copyright year, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation links, and a cart icon button with item count badge that opens a CartDrawer.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a Header, Footer, and a flex-column structure using TanStack Router's Outlet.",
  "frontend/src/components/OrderRow.tsx": "Collapsible order row for the admin orders view, displaying order details, status badge, and a dropdown to update order status via mutation.",
  "frontend/src/components/ProductCard.tsx": "Product card UI showing image, name, description, price, stock status, and an Add to Cart button that calls the provided onAddToCart callback.",
  "frontend/src/contexts/CartContext.tsx": "React context providing cart state (items, totals) and actions (add, remove, update quantity, clear) via a useReducer-based CartProvider.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication using DFINITY's AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "TanStack Query hooks for fetching products and orders, and mutations for placing orders, updating order status, and seeding products via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Lato), sets up Tailwind directives, and defines a saffron-cream-maroon OKLCH color palette as CSS custom properties for both light and dark themes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Admin page that fetches and displays all orders sorted by timestamp, shows status count stats (pending/processing/dispatched/delivered), and renders each order via an OrderRow component with a refresh button.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with category tabs that fetches all products, auto-seeds data if none are found on first load, and renders product cards in a responsive grid with loading skeletons and error state.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with a form (name, phone, address) that places an order via mutation, shows an order confirmation screen on success, and handles empty cart and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color palettes (saffron, maroon, cream, sidebar), Playfair Display/Lato font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking existing features (fix product fetching, auto-seed logic) and a pending backend task (AR-2) to ensure getProducts returns frontend-compatible data for the Maa Gayatri Stationers app."
}